# LoopsDoNotSubdivideFace Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FaceSplitterFailures..::..LoopsDoNotSubdivideFace Property
BuiltInFailures..::..FaceSplitterFailures Class See Also
---
Sketched loops must sub-divide the face into two or more completely enclosed regions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LoopsDoNotSubdivideFace { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LoopsDoNotSubdivideFace As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LoopsDoNotSubdivideFace {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FaceSplitterFailures Class
Autodesk.Revit.DB Namespace